### Variable

In [1]:
nama = 'Fikri'

In [2]:
nama + 'Susilo'

'FikriSusilo'

In [3]:
nama = 'Andi'

In [4]:
nama

'Andi'

### List

In [15]:
nama = 'Fikri Susatyo Budi'.split(' ')

In [12]:
print(nama)

['Fikri', 'Susatyo']

In [11]:
for i in nama:
    print(i)

Fikri
Susatyo

In [13]:
for i in range(len(nama)):
    print(nama[i])

Fikri
Susatyo

In [18]:
for item in nama:
    if( item[0].lower() == 'f'):
        print(item)

Fikri

In [19]:
stri = 'Purwadhika'

In [21]:
stri[1]

'u'

### Dictionary

In [22]:
movie = {
    'judul' : 'Harry Potter',
    'tahun' : 2003
}

In [24]:
movie['judul']

'Harry Potter'

In [25]:
movie['tahun']

2003

### Numpy Array

In [29]:
from numpy import array

In [30]:
nama = 'Fikri Susatyo Budi'.split(' ')

In [32]:
np = array(nama)

In [34]:
for item in np:
    print(item)

Fikri
Susatyo
Budi

###  Pandas

In [35]:
import pandas as pd

In [36]:
nama = 'Fikri Susatyo Budi'.split(' ')

In [39]:
ser= pd.Series(nama,index=['a','b','c'])

In [40]:
ser.value_counts()

Susatyo    1
Fikri      1
Budi       1
dtype: int64

In [41]:
ser.unique()

array(['Fikri', 'Susatyo', 'Budi'], dtype=object)

In [42]:
ser.nunique()

3

In [47]:
nama = 'Fikri Susatyo Budi Fikri'.split(' ')

### DataFrame

### Row

In [49]:
data = [
    [1,2,3],
    [4,5,6]
]

In [54]:
df = pd.DataFrame(data,columns=['A','B','C'],index=['W','Y'])

In [56]:
df.head()

   A  B  C
W  1  2  3
Y  4  5  6

In [60]:
df['A']

W    1
Y    4
Name: A, dtype: int64

In [64]:
df.loc['W']

A    1
B    2
C    3
Name: W, dtype: int64

In [65]:
df.iloc[0]

A    1
B    2
C    3
Name: W, dtype: int64

In [66]:
df

   A  B  C
W  1  2  3
Y  4  5  6

In [67]:
df[df['B'] > 3]

   A  B  C
Y  4  5  6

In [68]:
import seaborn as sns

In [70]:
df_tip= sns.load_dataset('tips')

In [71]:
df_tip.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

### jumlah Perokok

In [73]:
len(df_tip[df_tip['smoker'] == 'Yes'])

93

In [81]:
def apply_total_bill(data):
    if(data > 40):
        return 'Kaya'
    elif(data > 10):
        return 'Sedang'
    else:
        return 'misqueen'

In [82]:
df_tip['total_bill'].apply(apply_total_bill).value_counts()

Sedang      217
misqueen     17
Kaya         10
Name: total_bill, dtype: int64

In [88]:
def apply_total_dan_tip(x):
    return x['tip'] / x['total_bill'] *100

In [93]:
df_tip[['total_bill' , 'tip']].apply(apply_total_dan_tip,axis=1).sort_values(ascending=False).head()

172    71.034483
178    41.666667
67     32.573290
232    29.198966
183    28.053517
dtype: float64

In [102]:
(df_tip['tip'] / df_tip['total_bill'] *100).describe()

count    244.000000
mean      16.080258
std        6.107220
min        3.563814
25%       12.912736
50%       15.476977
75%       19.147549
max       71.034483
dtype: float64

In [98]:
df_tip.loc[172]

total_bill      7.25
tip             5.15
sex             Male
smoker           Yes
day              Sun
time          Dinner
size               2
Name: 172, dtype: object